#+Title: Aula ExampleLoginApp
#+Subtitle: Sem banco de dados

* Apresentação do projeto e seus artefatos
  
  
   #+NAME: ls projeto 
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $projetosDir/ExampleLoginApp1
      ls -l
   #+END_SRC

   #+RESULTS: ls projeto
   #+begin_example

   [wagner@Unknown ExampleLoginApp1]$ total 44
   drwxrwxr-x. 5 wagner wagner 4096 mar  6 22:56 app
   drwxrwxr-x. 3 wagner wagner 4096 mar  6 22:22 build
   -rw-rw-r--. 1 wagner wagner  710 mar  6 22:17 build.gradle
   -rw-rw-r--. 1 wagner wagner  893 mar  6 22:07 ExampleLoginApp1.iml
   drwxrwxr-x. 3 wagner wagner 4096 mar  6 22:06 gradle
   -rw-rw-r--. 1 wagner wagner  817 mar  6 22:07 gradle.properties
   -rwxrw-r--. 1 wagner wagner 5296 mar  6 22:06 gradlew
   -rw-rw-r--. 1 wagner wagner 2260 mar  6 22:06 gradlew.bat
   -rw-rw-r--. 1 wagner wagner  437 mar  6 22:06 local.properties
   -rw-rw-r--. 1 wagner wagner   15 mar  6 22:06 settings.gradle
   #+end_example



   Nosso código é só o arquivo  ExampleLoginActivity.kt e SimulaDB.kt
   e o resource xml da activity
   
   Vamos mostrar os arquivos logo abaixo
   
   #+NAME: ls projeto1
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      echo $projetosDir
      cd $projetosDir/ExampleLoginApp1      
      ls -l app/src/main/java/loginapp/example/fzlbpms/com/br/exampleloginapp1
      ls -l app/src/main/res/layout
   #+END_SRC

   #+RESULTS: ls projeto1
   : 
   : /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/android/projetos
   : [wagner@Unknown ExampleLoginApp1]$ total 8
   : -rw-rw-r--. 1 wagner wagner 1351 mar  6 22:26 ExampleLoginActivity.kt
   : -rw-rw-r--. 1 wagner wagner  801 mar  6 22:29 SimulaDB.kt
   : total 8
   : -rw-rw-r--. 1 wagner wagner 1440 mar  6 22:09 activity_example_login.xml
   : -rw-rw-r--. 1 wagner wagner 2259 mar  6 22:21 content_example_login.xml


   #+INCLUDE: /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/android/projetos/ExampleLoginApp1/app/src/main/java/loginapp/example/fzlbpms/com/br/exampleloginapp1/ExampleLoginActivity.kt :src kotlin

   #+INCLUDE: /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/android/projetos/ExampleLoginApp1/app/src/main/java/loginapp/example/fzlbpms/com/br/exampleloginapp1/SimulaDB.kt :src kotlin

   #+INCLUDE: /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/android/projetos/ExampleLoginApp1/app/src/main/res/layout/activity_example_login.xml :src xml

   #+INCLUDE: /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/android/projetos/ExampleLoginApp1/app/src/main/res/layout/content_example_login.xml :src  xml

